------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\andres\repositories\taskb\old survey\output\logs\main.log
  log type:  text
 opened on:  21 Feb 2026, 13:37:36

. 
. * import raw data
. import delimited "$rawdata\data_raw.csv", clear varnames(1) bindquote(strict) stripquotes(yes)
(encoding automatically selected: ISO-8859-1)
(34 vars, 18 obs)

. save "$cleandata\data_clean.dta", replace
file C:\Users\andres\repositories\taskb\old survey\data\clean\data_clean.dta saved

. 
. * drop qualtrics headers and destring
. drop in 1/2
(2 observations deleted)

. destring _all, replace
startdate: contains nonnumeric characters; no replace
enddate: contains nonnumeric characters; no replace
status: all characters numeric; replaced as byte
ipaddress: contains nonnumeric characters; no replace
progress: all characters numeric; replaced as byte
durationinseconds: all characters numeric; replaced as int
finished: all characters numeric; replaced as byte
recordeddate: contains nonnumeric characters; no replace
responseid: contains nonnumeric characters; no replace
recipientlastname: all characters numeric; replaced as byte
(16 missing values generated)
recipientfirstname: all characters numeric; replaced as byte
(16 missing values generated)
recipientemail: all characters numeric; replaced as byte
(16 missing values generated)
externalreference: all characters numeric; replaced as byte
(16 missing values generated)
locationlatitude: all characters numeric; replaced as double
locationlongitude: all characters numeric; replaced as double
distributionchannel: contains nonnumeric characters; no replace
userlanguage: contains nonnumeric characters; no replace
q1_1: all characters numeric; replaced as byte
(3 missing values generated)
q2: contains nonnumeric characters; no replace
q3: all characters numeric; replaced as byte
(3 missing values generated)
q3_7_text: all characters numeric; replaced as byte
(16 missing values generated)
q4_1: all characters numeric; replaced as byte
(4 missing values generated)
q4_2: all characters numeric; replaced as byte
(4 missing values generated)
q5: all characters numeric; replaced as byte
(4 missing values generated)
q6_1: all characters numeric; replaced as byte
(5 missing values generated)
q6_2: all characters numeric; replaced as byte
(5 missing values generated)
q6_3: all characters numeric; replaced as byte
(5 missing values generated)
q7: all characters numeric; replaced as byte
(5 missing values generated)
q8: all characters numeric; replaced as byte
(5 missing values generated)
q8_5_text: all characters numeric; replaced as byte
(16 missing values generated)
q9: all characters numeric; replaced as byte
(5 missing values generated)
q10: all characters numeric; replaced as byte
(5 missing values generated)
q11: all characters numeric; replaced as byte
(5 missing values generated)
q11_4_text: all characters numeric; replaced as byte
(16 missing values generated)

. 
. drop if finished == 0
(5 observations deleted)

. 
. * remove unused variables
. drop startdate enddate status ipaddress progress recordeddate responseid recipient* location* distributionchannel userlanguage ext
> ernalreference durationinseconds finished

. 
. * stats
. sum q1_1 q4* q6*

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        q1_1 |         11    2.454545    .9341987          1          4
        q4_1 |         11    3.454545    .6875517          2          4
        q4_2 |         11           4    .7745967          3          5
        q6_1 |         11    3.363636    1.286291          1          5
        q6_2 |         11    1.636364    .6741999          1          3
-------------+---------------------------------------------------------
        q6_3 |         11    3.545455     1.21356          2          5

. 
. gen q3_right = (q3 == 3) & !missing(q3)

. tab q3_right

   q3_right |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          8       72.73       72.73
          1 |          3       27.27      100.00
------------+-----------------------------------
      Total |         11      100.00

. 
. gen q2_right = (strpos(q2, "3") > 0 | strpos(q2, "6") > 0) if !missing(q2)

. tab q2_right

   q2_right |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       36.36       36.36
          1 |          7       63.64      100.00
------------+-----------------------------------
      Total |         11      100.00

. 
. forval i = 1/8 {
  2.     gen q2_`i' = (strpos(q2, "`i'") > 0) if !missing(q2)
  3. }

. 
. mrtab q2_1-q2_8

            |             Percent of     Percent
            |  Frequency   responses    of cases
------------+-----------------------------------
       q2_1 |          0        0.00        0.00
       q2_2 |          0        0.00        0.00
       q2_3 |          1        5.88        9.09
       q2_4 |          2       11.76       18.18
       q2_5 |          3       17.65       27.27
       q2_6 |          6       35.29       54.55
       q2_7 |          5       29.41       45.45
       q2_8 |          0        0.00        0.00
------------+-----------------------------------
      Total |         17      100.00      154.55

Valid cases:         11
Missing cases:        0

. 
. tab 
varlist required
r(100);

end of do-file

r(100);

. do "C:\Users\andres\AppData\Local\Temp\STD3008_000002.tmp"

. tab q8 q9 q10
too many variables specified
r(103);

end of do-file

r(103);

. do "C:\Users\andres\AppData\Local\Temp\STD3008_000003.tmp"

. tab q8

         Q8 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          3       27.27       27.27
          2 |          6       54.55       81.82
          3 |          1        9.09       90.91
          4 |          1        9.09      100.00
------------+-----------------------------------
      Total |         11      100.00

. tab q9

         Q9 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          1        9.09        9.09
          2 |          4       36.36       45.45
          3 |          5       45.45       90.91
          4 |          1        9.09      100.00
------------+-----------------------------------
      Total |         11      100.00

. tab q10

        Q10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          6       54.55       54.55
          2 |          2       18.18       72.73
          4 |          3       27.27      100.00
------------+-----------------------------------
      Total |         11      100.00

. tab q11

        Q11 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          2       18.18       18.18
          2 |          4       36.36       54.55
          3 |          5       45.45      100.00
------------+-----------------------------------
      Total |         11      100.00

. 
end of do-file

. save "C:\Users\andres\repositories\taskb\old survey\data\clean\data_clean.dta", replace
file C:\Users\andres\repositories\taskb\old survey\data\clean\data_clean.dta saved

. exit
